In [ ]:
Aim= To learn about descriptive statistics of a data set.

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
df=pd.read_csv("C:\\Users\\Welcome\\Documents\\customerinfo.csv")

In [5]:
df

     SR NO  CUSTOMER ID  GENDER  AGE  ANNUAL INCOME  SPENDING SCORE
0        1          582       1   47          29529              69
1        2          748       1   26          34771              56
2        3          191       2   37          44838              96
3        4          272       2   34          22169              65
4        5          809       1   41          26460              12
..     ...          ...     ...  ...            ...             ...
195    196          830       1   25          39716              23
196    197          127       1   42          20019               5
197    198          459       1   37          43772              78
198    199          744       2   39          29604              97
199    200          561       1   29          22752              39

[200 rows x 6 columns]

In [6]:
df.mean()

SR NO               100.500
CUSTOMER ID         549.600
GENDER                1.385
AGE                  37.635
ANNUAL INCOME     36009.770
SPENDING SCORE       50.405
dtype: float64

In [8]:
df.loc[:,'AGE'].mean()

37.635

In [9]:
df

     SR NO  CUSTOMER ID  GENDER  AGE  ANNUAL INCOME  SPENDING SCORE
0        1          582       1   47          29529              69
1        2          748       1   26          34771              56
2        3          191       2   37          44838              96
3        4          272       2   34          22169              65
4        5          809       1   41          26460              12
..     ...          ...     ...  ...            ...             ...
195    196          830       1   25          39716              23
196    197          127       1   42          20019               5
197    198          459       1   37          43772              78
198    199          744       2   39          29604              97
199    200          561       1   29          22752              39

[200 rows x 6 columns]

In [10]:
df=pd.read_csv("C:\\Users\\Welcome\\Documents\\customerinfo.csv")

In [11]:
df

     SR NO  CUSTOMER ID  GENDER  AGE  ANNUAL INCOME  SPENDING SCORE
0        1          582    male   47          29529              69
1        2          748    male   26          34771              56
2        3          191  female   37          44838              96
3        4          272  female   34          22169              65
4        5          809    male   41          26460              12
..     ...          ...     ...  ...            ...             ...
195    196          830    male   25          39716              23
196    197          127    male   42          20019               5
197    198          459    male   37          43772              78
198    199          744  female   39          29604              97
199    200          561    male   29          22752              39

[200 rows x 6 columns]

In [12]:
df.mean(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_10568\3421726114.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)[0:4]

0    6045.6
1    7120.6
2    9033.0
3    4508.8
dtype: float64

In [13]:
df.median()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_10568\4151078170.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

SR NO               100.5
CUSTOMER ID         579.5
AGE                  38.0
ANNUAL INCOME     36726.5
SPENDING SCORE       53.5
dtype: float64

In [15]:
df.loc[:,'AGE'].median()

38.0

In [16]:
df.median(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_10568\3013330836.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median(axis=1)[0:4]

0    69.0
1    56.0
2    96.0
3    65.0
dtype: float64

In [17]:
df.mode()

     SR NO  CUSTOMER ID GENDER   AGE  ANNUAL INCOME  SPENDING SCORE
0        1        161.0   male  39.0          20019            15.0
1        2        167.0    NaN   NaN          20522            62.0
2        3        184.0    NaN   NaN          20820             NaN
3        4        214.0    NaN   NaN          21104             NaN
4        5        230.0    NaN   NaN          21305             NaN
..     ...          ...    ...   ...            ...             ...
195    196          NaN    NaN   NaN          49457             NaN
196    197          NaN    NaN   NaN          49612             NaN
197    198          NaN    NaN   NaN          49777             NaN
198    199          NaN    NaN   NaN          49799             NaN
199    200          NaN    NaN   NaN          49943             NaN

[200 rows x 6 columns]

In [18]:
df.loc[:,'AGE'].mode()

0    39
Name: AGE, dtype: int64

In [19]:
df.min()

SR NO                  1
CUSTOMER ID          116
GENDER            female
AGE                   25
ANNUAL INCOME      20019
SPENDING SCORE         2
dtype: object

In [20]:
df.loc[:,'AGE'].min(skipna = False)

25

In [21]:
df.max()

SR NO               200
CUSTOMER ID         996
GENDER             male
AGE                  50
ANNUAL INCOME     49943
SPENDING SCORE      100
dtype: object

In [22]:
df.loc[:,'AGE'].max(skipna = False)

50

In [23]:
df.std()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_10568\3390915376.py:1: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

SR NO               57.879185
CUSTOMER ID        252.775150
AGE                  7.538962
ANNUAL INCOME     8157.467081
SPENDING SCORE      29.451791
dtype: float64

In [25]:
df.loc[:,'AGE'].std()

7.538962446774047

In [26]:
df.std(axis=1)[0:4]

C:\Users\Welcome\AppData\Local\Temp\ipykernel_10568\2185080913.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std(axis=1)[0:4]

0    13129.748086
1    15460.199216
2    20015.730526
3     9872.911865
dtype: float64

In [27]:
df.groupby(['GENDER'])['AGE'].mean()

GENDER
female    37.935065
male      37.447154
Name: AGE, dtype: float64

In [28]:
df_u=df.rename(columns= {'ANNUAL INCOME':'Income'},inplace=False)
(df_u.groupby(['GENDER']).Income.mean())

GENDER
female    35904.220779
male      36075.845528
Name: Income, dtype: float64

In [30]:
from sklearn import preprocessing 
enc = preprocessing.OneHotEncoder() 
enc_df = pd.DataFrame(enc.fit_transform(df[['GENDER']]).toarray()) 
enc_df

       0    1
0    0.0  1.0
1    0.0  1.0
2    1.0  0.0
3    1.0  0.0
4    0.0  1.0
..   ...  ...
195  0.0  1.0
196  0.0  1.0
197  0.0  1.0
198  1.0  0.0
199  0.0  1.0

[200 rows x 2 columns]

In [31]:
df_encode =df_u.join(enc_df) 
df_encode

     SR NO  CUSTOMER ID  GENDER  AGE  Income  SPENDING SCORE    0    1
0        1          582    male   47   29529              69  0.0  1.0
1        2          748    male   26   34771              56  0.0  1.0
2        3          191  female   37   44838              96  1.0  0.0
3        4          272  female   34   22169              65  1.0  0.0
4        5          809    male   41   26460              12  0.0  1.0
..     ...          ...     ...  ...     ...             ...  ...  ...
195    196          830    male   25   39716              23  0.0  1.0
196    197          127    male   42   20019               5  0.0  1.0
197    198          459    male   37   43772              78  0.0  1.0
198    199          744  female   39   29604              97  1.0  0.0
199    200          561    male   29   22752              39  0.0  1.0

[200 rows x 8 columns]

In [32]:
df.mean()

C:\Users\Welcome\AppData\Local\Temp\ipykernel_10568\3759992827.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

SR NO               100.500
CUSTOMER ID         549.600
AGE                  37.635
ANNUAL INCOME     36009.770
SPENDING SCORE       50.405
dtype: float64

In [ ]:
NAME:SHREYA JADHAV
ROLL NO:13207